comsys/service.html
---
layout: page
title: Dienst
---

<p>
Ein <b>Dienst</b> ist eine genau beschriebene Leistung, die ein Protokoll, eine
Anwedung oder sonstiges erbrigt und für andere anbietet. Der Begriff
<i>Dienst</i> wird daher oft unscharf verwendet:
</p>

<ul class="org-ul">
<li>Jede Netzwerkanwendung kann als <i>Dienst</i> (Service) bezeichnet werden,
z.B.:

<ul class="org-ul">
<li>Domain Name Service (DNS): Auflösung von Domain Namen zu IP Adressen
(engl. <i>name resolution</i>)
</li>
<li>File Transfer (FTP, SFTP):
</li>
<li>File Sharing: z.B. Peer-to-peer Dienste (unterscheidet sich von
FTP und SFTP dadurch, dass die Rolle des Clients <i>und</i> des Server
einnehmen kann)
</li>
<li>Network File System: Einbinden von Remote-Verzeichnissen in den
lokalen Verzeichnisbaum
</li>
<li>Terminal Emulation: Z.B. ssh
</li>
<li>E-Mail
</li>
<li>Voice over IP
</li>
<li>Webanwendungen
</li>
</ul>
</li>

<li>Jeder "Subdienst", den ein Protokoll (z.B. IP, TCP, UDP, HTTP)
erbringt kann als <i>Dienst</i> bezeichnet werden, z.B.:

<ul class="org-ul">
<li>in order packet delivery (ein Dienst von TCP)
</li>
<li>packet routing (
</li>
<li><i>marshalling/unmarshalling</i>: packet coding/decoding
</li>
</ul>
</li>
</ul>
